Revit 2026 API

# FilteredElementIterator Methods

---

The FilteredElementIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | The current element found by the iterator. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next element passing the filter. |
|  | Reset | Resets the iterator to the beginning. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FilteredElementIterator Class

Autodesk.Revit.DB Namespace